<?php
// 半角英字を全角：R
// 「全角ひらがな」を「全角カタカナ」に変換：C
// 「半角カタカナ」を「全角カタカナ」に変換：K
// 「半角」数字を「全角」に変換：N

class CheckConvertStr
{
    public function index()
    {
        $str1 = 'ｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｧｨｩｪｫｬｭｮｯｰﾞﾟ｡｢｣､･ｶﾞｷﾞｸﾞｹﾞｺﾞｻﾞｼﾞｽﾞｾﾞｿﾞﾀﾞﾁﾞﾂﾞﾃﾞﾄﾞﾊﾞﾊﾟﾋﾞﾋﾟﾌﾞﾌﾟﾍﾞﾍﾟﾎﾞﾎﾟｳﾞﾜﾞｦﾞ';
        $str2 = 'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヽヾヵヶヷヸヹヺー';
        $str3 = 'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゝゞゕゖー';
        $str4 = 'か゛き゛く゛け゛こ゛さ゛し゛す゛せ゛そ゛た゛ち゛つ゛て゛と゛は゛ひ゛ふ゛へ゛ほ゛う゛は゜ひ゜ふ゜へ゜ほ゜カ゛キ゛ク゛ケ゛コ゛サ゛シ゛ス゛セ゛ソ゛タ゛チ゛ツ゛テ゛ト゛ハ゛ヒ゛フ゛ヘ゛ホ゛ウ゛ワ゛ヰ゛ヱ゛ヲ゛ハ゜ヒ゜フ゜ヘ゜ホ゜';
        $str5 = 'がぎぐげござじずぜぞだぢづでどばびぶべぼゔぱぴぷぺぽガギグゲゴザジズゼゾダヂヅデドバビブベボヴヷヸヹヺパピプペポ';
        echo $this->Convert($str1);
        echo $this->Convert($str2);
        echo $this->Convert($str3);
        echo $this->Convert($str4);
        echo $this->Convert($str5);
    }

    public static function Convert($str)
    {
        $option = "KVCA";
        $str2 = mb_convert_kana($str, $option);
        $r = mb_strtoupper($str2);
        return $r;
    }
}

$var_class = new CheckConvertStr();
$var_class->index();
