<?php
// 半角英字を全角：R
// 「全角ひらがな」を「全角カタカナ」に変換：C
// 「半角カタカナ」を「全角カタカナ」に変換：K
// 「半角」数字を「全角」に変換：N

$str1 = 'ｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｧｨｩｪｫｬｭｮｯｰﾞﾟ｡｢｣､･ｶﾞｷﾞｸﾞｹﾞｺﾞｻﾞｼﾞｽﾞｾﾞｿﾞﾀﾞﾁﾞﾂﾞﾃﾞﾄﾞﾊﾞﾊﾟﾋﾞﾋﾟﾌﾞﾌﾟﾍﾞﾍﾟﾎﾞﾎﾟｳﾞﾜﾞｦﾞ';
$str2 = 'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヽヾヵヶヷヸヹヺー';
$str3 = 'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゝゞゕゖー';
$str4 = 'か゛き゛く゛け゛こ゛さ゛し゛す゛せ゛そ゛た゛ち゛つ゛て゛と゛は゛ひ゛ふ゛へ゛ほ゛う゛は゜ひ゜ふ゜へ゜ほ゜カ゛キ゛ク゛ケ゛コ゛サ゛シ゛ス゛セ゛ソ゛タ゛チ゛ツ゛テ゛ト゛ハ゛ヒ゛フ゛ヘ゛ホ゛ウ゛ワ゛ヰ゛ヱ゛ヲ゛ハ゜ヒ゜フ゜ヘ゜ホ゜';
$str5 = 'がぎぐげござじずぜぞだぢづでどばびぶべぼゔぱぴぷぺぽガギグゲゴザジズゼゾダヂヅデドバビブベボヴヷヸヹヺパピプペポ';
$str6 = '！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～';
$str7 = '!"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~';
$str8 = 'ㇰㇱㇲㇳㇴㇵㇶㇷㇸㇹㇺㇻㇼㇽㇾㇿ';
$str9 = '⦅⦆¢£¬¯¦¥₩￨￩￪￫￬￭￮';
$str10 = '｟｠￠￡￢￣￤￥￦│←↑→↓■○';

/* 文字列を定義 */
$str_kana = "ABC ＡＢＣ abc 123 １２３ ｱｲｳｴｵ アイウエオ　あいうえお　ぁぃぅぇぉ　田中";
$str_u = mb_strtoupper($str_kana);
var_dump( mb_convert_kana($str_kana) );
var_dump( mb_convert_kana($str_kana, 'kvrn') );
var_dump( mb_convert_kana($str_kana, 'KVRN') );
var_dump( mb_convert_kana($str_kana, 'ACK') );
var_dump( mb_convert_kana($str_u, 'ACK') );
var_dump( mb_convert_kana($str2, 'ACK') );
var_dump( mb_convert_kana($str3, 'ACK') );
var_dump( mb_convert_kana($str4, 'ACK') );
var_dump( mb_convert_kana($str5, 'ACK') );
var_dump( mb_convert_kana($str6, 'ACK') );
